[Killed] BlockStatement
src/app/pipes/camel-case.pipe.ts:6:25
 @Pipe({ name: 'camelcase', pure: true })
 export class CamelCasePipe implements PipeTransform {
 
-  transform(value: any) {
-    if (!value) {
-      return '';
-    }
-    
-    const words = value.split(' ');
-    let output= '';
-
-    for (const word of words) {
-      if (!word) continue;
-      output += word[0].toUpperCase() + word.slice(1).toLowerCase();
-    }
-    output = output[0].toLowerCase() + output.slice(1);
-    return output;
-  }
+  transform(value: any) {}
 }
killedBy: Pipe: Camelcase should lowercase a single word
statusReason: Error: Expected undefined to be 'hallo'.

[Killed] ConditionalExpression
src/app/pipes/camel-case.pipe.ts:7:9
 export class CamelCasePipe implements PipeTransform {
 
   transform(value: any) {
-    if (!value) {
+    if (true) {
       return '';
     }
killedBy: Pipe: Camelcase should lowercase a single word
statusReason: Error: Expected '' to be 'hallo'.

[Killed] ConditionalExpression
src/app/pipes/camel-case.pipe.ts:7:9
 export class CamelCasePipe implements PipeTransform {
 
   transform(value: any) {
-    if (!value) {
+    if (false) {
       return '';
     }
killedBy: Pipe: Camelcase should replace an undefined value with an empty string
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
src/app/pipes/camel-case.pipe.ts:14:31
     const words = value.split(' ');
     let output= '';
 
-    for (const word of words) {
-      if (!word) continue;
-      output += word[0].toUpperCase() + word.slice(1).toLowerCase();
-    }
+    for (const word of words) {}
     output = output[0].toLowerCase() + output.slice(1);
     return output;
killedBy: Pipe: Camelcase should lowercase a single word
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/app/pipes/camel-case.pipe.ts:15:11
     let output= '';
 
     for (const word of words) {
-      if (!word) continue;
+      if (false) continue;
       output += word[0].toUpperCase() + word.slice(1).toLowerCase();
     }
killedBy: Pipe: Camelcase should handle multiple spaces gracefully
statusReason: TypeError: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] ConditionalExpression
src/app/pipes/camel-case.pipe.ts:15:11
     let output= '';
 
     for (const word of words) {
-      if (!word) continue;
+      if (true) continue;
       output += word[0].toUpperCase() + word.slice(1).toLowerCase();
     }
killedBy: Pipe: Camelcase should lowercase a single word
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] AssignmentOperator
src/app/pipes/camel-case.pipe.ts:16:7
 
     for (const word of words) {
       if (!word) continue;
-      output += word[0].toUpperCase() + word.slice(1).toLowerCase();
+      output -= word[0].toUpperCase() + word.slice(1).toLowerCase();
     }
     output = output[0].toLowerCase() + output.slice(1);
killedBy: Pipe: Camelcase should lowercase a single word
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ArithmeticOperator
src/app/pipes/camel-case.pipe.ts:16:17
 
     for (const word of words) {
       if (!word) continue;
-      output += word[0].toUpperCase() + word.slice(1).toLowerCase();
+      output += word[0].toUpperCase() - word.slice(1).toLowerCase();
     }
     output = output[0].toLowerCase() + output.slice(1);
killedBy: Pipe: Camelcase should lowercase a single word
statusReason: Error: Expected 'naN' to be 'hallo'.

[Killed] ArithmeticOperator
src/app/pipes/camel-case.pipe.ts:18:14
       if (!word) continue;
       output += word[0].toUpperCase() + word.slice(1).toLowerCase();
     }
-    output = output[0].toLowerCase() + output.slice(1);
+    output = output[0].toLowerCase() - output.slice(1);
     return output;
   }
killedBy: Pipe: Camelcase should lowercase a single word
statusReason: Error: Expected NaN to be 'hallo'.
